{"posts":[{"title":"CS742: Advanced Internet: Global Data Communications","text":"Measurement Fog computingusing cloud computing for main computing workload, but put task that require more responsive calculation on the edge section package frame ACM Digital Library IEEE Xplore SpingerLink Science Direct(ELSEVIER) Wiley Taylor &amp; Fracis DecibelsPower ratios10:1 = 10dB1:1 = 0dB100:1 = 20dB1000:1 = 30dB1:10 = -10dB Approximately 1.25:1 = 1dB2:1 = 3dB4:1 = 6dB8:1 = 9dB1:4 = -6dB32:1 = 15dB Voltage ratios10:1 = 20dB1:1 = 0dB100:1 = 40dB1000:1 = 60dB1:10 = -20dB Approximately 2:1 = 6dB4:1 = 12dB8:1 = 18dB1:4 = -12dB32:1 = 30dB1.4:1 = 1.5:1 = 3dB example:47527:1 this can be round up to 50000:1which is $100,000\\div 2 = 10^{5} * 2^{-2} = 50-3 dB = 47 dB$ dBm, power compared to 1mW in dB Feedline connect devices and their antenna Antennas gain in dBi or dBd directionality polarization reciprocal Aperture $path\\ loss = \\frac{(4\\pi r)^{2}}{\\lambda}$ $path\\ loss(dB) = 10 \\log_{10} \\frac{(4\\pi r)^{2}}{\\lambda}$ $P_{RX} = \\frac{P_{T}G_{T}G_{Rx}\\lambda^{2}}{(4\\pi r)^{2}}$","link":"/2023/10/09/CS742-Advanced-Internet-Global-Data-Communications/"},{"title":"mpv+yt-dlp","text":"whyyt-dlp is a alternative for youtube-dl. Although mpv have a built-in youtube-dl, it is not competable with yt-dlp by default. problemInstall mpv the way you prefer and install yt-dlp as well.In my case I installed mpv and vapoursynth first and then I install yt-dlp. After installation first test both applications works as excepted. At this point mpv http://xxxx.com works but built-in youtube-dl is used. In order to replace that, install yt-dlp-drop-in in AUR and for OS that don’t have such thing try ln -s ${which yt-dlp} /usr/bin/youtube-dlAnd then 123#/mpv.confscript-opts=ytdl_hook-ytdl_path=/usr/bin/yt-dlp Now, yt-dlp is called successfully. Call with argumentsonly 480P videos playedSo I tried add args behind /usr/bin/yt-dlp, is returns errormy solution is try add 123#~/.yt-dlp/config.txt--cookies-from-browser firefox In this way websides like bilibili works normally.","link":"/2023/10/09/mpv+yt-dlp/"}],"tags":[{"name":"CS742","slug":"CS742","link":"/tags/CS742/"},{"name":"Network","slug":"Network","link":"/tags/Network/"},{"name":"Unix","slug":"Unix","link":"/tags/Unix/"}],"categories":[],"pages":[{"title":"brief about me","text":"who am IHi there, my name is Winson, Nice to meet you!I’m currently a Master student in Digital security. why started writing blogThis question dated back to 2020, with COVID-19 virus spreading across China, I had to study at home for a whole semester. And during that period I build my own All-In-One server which I later used to host a GHOST blog system on it. After frequently sharing my markdown course note with friends, I thought now I have a server, building a docker-base blog system should be quite easy and cool. And it turned out I enjoy sharing my thought about life and some IT stuff with others. why change into this HexoTo be honest, I haven’t try much ways to host my blog the reason I switch from GHOST to Hexo is some of my note include mathjax which is poorly supported on GHOST and Hexo’s static makes it more flexible. And moving from markdown file to another markdown file is significantly easier than to move to a web-base markdown editor.","link":"/about/index.html"}]}